toasterllc/MDCCode/Code/STM32/Shared/USB.h
    // Accessors
    static State StateGet() {
        Toastbox::IntState ints(false);
        return _State;
    }
    
    // Methods
    static void Connect() {
        Toastbox::IntState ints(false);
        if (_State != State::Connecting) return; // Short-circuit if we're not Connecting
        _State = State::Connected;
    }
    
    static void EndpointReset(uint8_t ep) {
        #warning TODO: wait until endpoints are ready
        Toastbox::IntState ints(false);
        _EndpointReset(ep);
    }
    
    static void EndpointsReset() {
        #warning TODO: wait until endpoints are ready
        Toastbox::IntState ints(false);
        for (uint8_t ep : {T_Endpoints...}) {
            _EndpointReset(ep);
        }
    }
    
    static bool EndpointReady(uint8_t ep) {
        Toastbox::IntState ints(false);
        return _EndpointReady(ep);
    }
    
    static bool EndpointsReady() {
        Toastbox::IntState ints(false);
        for (uint8_t ep : {T_Endpoints...}) {
            if (!_EndpointReady(ep)) return false;
        }
        return true;
    }
    
    static std::optional<Cmd> CmdRecv() {
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
        return _Cmd;
    }
    
    static void CmdAccept(bool accept) {
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return; // Short-circuit if we're not Connected
        
        if (accept) USBD_CtlSendStatus(&_Device);
        else        USBD_CtlError(&_Device, nullptr);
        
        _Cmd = std::nullopt;
    }
    
    static std::optional<size_t> Recv(uint8_t ep, void* data, size_t len) {
        #warning TODO: wait until endpoints are ready
        AssertArg(EndpointOut(ep));
        _OutEndpoint& outep = _OutEndpointGet(ep);
        
        {
            Toastbox::IntState ints(false);
            if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
            
            Assert(_Ready(outep));
            _AdvanceState(ep, outep);
            
            USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)data, len);
            Assert(us == USBD_OK);
        }
        
        auto waitResult = T_Scheduler::Wait([=] { return _EndpointWait(ep, outep); });
        return waitResult.result;
    }
    
//    static size_t RecvLen(uint8_t ep) {
//        AssertArg(EndpointOut(ep));
//        
//        Toastbox::IntState ints(false);
//        if (_State != State::Connected) return 0; // Short-circuit if we're not Connected
//        return _RecvLen(_OutEndpointGet(ep));
//    }
    
    static bool Send(uint8_t ep, const void* data, size_t len) {
        #warning TODO: wait until endpoints are ready
        AssertArg(EndpointIn(ep));
        _InEndpoint& inep = _InEndpointGet(ep);
        
        {
            Toastbox::IntState ints(false);
            if (_State != State::Connected) return false; // Short-circuit if we're not Connected
            
            Assert(_Ready(inep));
            _AdvanceState(ep, inep);
            
            USBD_StatusTypeDef us = USBD_LL_Transmit(&_Device, ep, (uint8_t*)data, len);
            Assert(us == USBD_OK);
        }
        
        auto waitResult = T_Scheduler::Wait([=] { return _EndpointWait(ep, inep); });
        return waitResult.result;
    }
    
    static void ISR() {
        ISR_HAL_PCD(&_PCD);
    }
    
private:
    static uint8_t _USBD_Init(uint8_t cfgidx) {
        // Open endpoints
        for (uint8_t ep : {T_Endpoints...}) {
            if (EndpointOut(ep)) {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeOut());
                _Device.ep_out[EndpointIdx(ep)].is_used = 1U;
                // Reset endpoint state
                _OutEndpointGet(ep) = {};
            
            } else {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeIn());
                _Device.ep_in[EndpointIdx(ep)].is_used = 1U;
                // Reset endpoint state
                _InEndpointGet(ep) = {};
            }
        }
        
        _Cmd = std::nullopt;
        _State = State::Connecting;
        
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DeInit(uint8_t cfgidx) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Suspend() {
        if (_State == State::Disconnected) return USBD_OK; // Short-circuit if we're already Disconnected
        
        Init();
        _State = State::Disconnected;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Resume() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Setup(USBD_SetupReqTypedef* req) {
        switch (req->bmRequest & USB_REQ_TYPE_MASK) {
        case USB_REQ_TYPE_VENDOR:
            USBD_CtlPrepareRx(&_Device, _CmdRecvBuf, sizeof(_CmdRecvBuf));
            return USBD_OK;
        
        default:
            USBD_CtlError(&_Device, req);
            return USBD_FAIL;
        }
    }
    
    static uint8_t _USBD_EP0_TxSent() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_EP0_RxReady() {
        const size_t dataLen = USBD_LL_GetRxDataSize(&_Device, 0);
        if (!_Cmd) {
            _Cmd = Cmd{
                .data = _CmdRecvBuf,
                .len = dataLen,
            };
        } else {
            // If a command is already underway, respond to the request with an error
            USBD_CtlError(&_Device, nullptr);
        }
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataIn(uint8_t ep) {
        // Sanity-check the endpoint state
        _InEndpoint& inep = _InEndpointGet(ep);
        Assert(
            inep.state == _EndpointState::ResetZLP1     ||
            inep.state == _EndpointState::ResetZLP2     ||
            inep.state == _EndpointState::ResetSentinel ||
            inep.state == _EndpointState::Busy
        );
        
        _AdvanceState(ep, inep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataOut(uint8_t ep) {
        // Sanity-check the endpoint state
        _OutEndpoint& outep = _OutEndpointGet(ep);
        Assert(
            outep.state == _EndpointState::ResetZLP1     ||
            outep.state == _EndpointState::ResetZLP2     ||
            outep.state == _EndpointState::ResetSentinel ||
            outep.state == _EndpointState::Busy
        );
        
        _AdvanceState(ep, outep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_SOF() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoINIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoOUTIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t* _USBD_GetHSConfigDescriptor(uint16_t* len) {
        size_t descLen = 0;
        const void*const desc = T_ConfigDesc(descLen);
        *len = descLen;
        return (uint8_t*)desc;
    }
    
