toasterllc/MDCCode/Code/STM32/Shared/USB.h
        // State transitions
        switch (inep.state) {
        case _EndpointState::Ready:         inep.state = _EndpointState::Busy;          break;
        case _EndpointState::Busy:          inep.state = _EndpointState::Done;          break;
        case _EndpointState::Done:          inep.state = _EndpointState::Ready;         break;
        case _EndpointState::Reset:         inep.state = _EndpointState::ResetZLP1;     break;
        case _EndpointState::ResetZLP1:     inep.state = _EndpointState::ResetZLP2;     break;
        case _EndpointState::ResetZLP2:     inep.state = _EndpointState::ResetSentinel; break;
        case _EndpointState::ResetSentinel: inep.state = _EndpointState::Ready;         break;
        default:                            abort();
        }
        
        // State actions
        switch (inep.state) {
        case _EndpointState::ResetZLP1:
        case _EndpointState::ResetZLP2:
            USBD_LL_TransmitZeroLen(&_Device, ep);
            break;
        case _EndpointState::ResetSentinel:
            USBD_LL_Transmit(&_Device, ep, (uint8_t*)&_ResetSentinel, sizeof(_ResetSentinel));
            break;
        default:
            break;
        }
    }
    
private:
    alignas(4) static const inline uint8_t _ResetSentinel = 0; // Aligned to send via USB
    
    // _DevNullAddr: address that throw-away data can be written to.
    // This must be a region that a packet can be written to without causing
    // side-effects. We don't want to reserve actual RAM for this because it'd
    // just be wasted.
    // We're currently using the flash base address, so that the writes will be
    // ignored as long as the flash isn't unlocked.
    static constexpr uint32_t _DevNullAddr = 0x08000000;
    
    static inline std::optional<Cmd> _Cmd;
    alignas(4) static inline uint8_t _CmdRecvBuf[MaxPacketSizeCtrl]; // Aligned to send via USB
    static inline _OutEndpoint _OutEndpoints[EndpointCountOut()] = {};
    static inline _InEndpoint _InEndpoints[EndpointCountIn()] = {};
    static inline USBD_HandleTypeDef _Device;
    static inline PCD_HandleTypeDef _PCD;
    static inline State _State = State::Disconnected;
};
